---
kind: method
id: M:Autodesk.Revit.DB.ShapeImporter.#ctor
source: html/4ee1ec99-2ebf-0758-8ffe-d2543012d34b.htm
---
# Autodesk.Revit.DB.ShapeImporter.#ctor Method

Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).

## Syntax (C#)
```csharp
public ShapeImporter()
```